; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v1)
		(pred_3 ?v7)
		(pred_6 ?v8)
		(pred_5 ?v8)
		(pred_4 ?v7 ?v8)
		(pred_2)
		(pred_1 ?v7))

   (:action op_3
       :parameters  (?v6 ?v5)
       :precondition (and (not-eq ?v6 ?v5) 
                          (pred_6 ?v6) (pred_6 ?v5) (pred_5 ?v6))
       :effect (and  (pred_5 ?v5)
		     (not (pred_5 ?v6))))


   (:action op_1
       :parameters (?v3 ?v2)
       :precondition  (and  (pred_3 ?v3) (pred_6 ?v2)
			    (pred_4 ?v3 ?v2) (pred_5 ?v2) (pred_2))
       :effect (and (pred_1 ?v3)
		    (not (pred_4 ?v3 ?v2)) 
		    (not (pred_2))))

   (:action op_2
       :parameters  (?v3  ?v2)
       :precondition  (and  (pred_3 ?v3) (pred_6 ?v2)
			    (pred_1 ?v3) (pred_5 ?v2))
       :effect (and (pred_4 ?v3 ?v2)
		    (pred_2)
		    (not (pred_1 ?v3)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_04 obj_01 obj_08 obj_06 obj_07 obj_03 
          obj_02 obj_05 
)
(:init
(pred_6 obj_04)
(pred_6 obj_01)
(pred_6 obj_08)
(pred_6 obj_06)
(pred_6 obj_07)
(pred_6 obj_03)
(pred_3 obj_02)
(pred_3 obj_05)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(pred_2)
(pred_4 obj_02 obj_03)
(pred_4 obj_05 obj_03)
(pred_5 obj_06)
)
(:goal
(and
(pred_4 obj_02 obj_06)
(pred_4 obj_05 obj_03)
)
)

(:constraints
  (sometime-before  (pred_4 obj_02 obj_06) (pred_5 obj_04))
)
)

; plan
1. (op_3 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 1 of 2
2. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_05 obj_03) (pred_2)
   added: (pred_1 obj_05)
   goals met: 0 of 2
3. (op_3 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 0 of 2
4. (op_2 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_4 obj_05 obj_04) (pred_2)
   goals met: 0 of 2
5. (op_3 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 0 of 2
6. (op_1 obj_02 obj_03)
   deleted: (pred_4 obj_02 obj_03) (pred_2)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_3 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_06)
   goals met: 0 of 2
8. (op_2 obj_02 obj_06)
   deleted: (pred_1 obj_02)
   added: (pred_4 obj_02 obj_06) (pred_2)
   goals met: 1 of 2
9. (op_3 obj_06 obj_04)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_04)
   goals met: 1 of 2
10. (op_1 obj_05 obj_04)
   deleted: (pred_4 obj_05 obj_04) (pred_2)
   added: (pred_1 obj_05)
   goals met: 1 of 2
11. (op_3 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 1 of 2
12. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_4 obj_05 obj_03) (pred_2)
   goals met: 2 of 2
